src/main/resources/samples/onvif-discovery-response-1.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
            xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
            xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
            xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
    <s:Header>
        <wsa:MessageID>uuid:41bc7196-c99f-dde5-3146-47b9c2059504
        </wsa:MessageID>
        <wsa:RelatesTo>urn:uuid:d2d0e9a4-f29a-4422-9c7f-750e2680bad2
        </wsa:RelatesTo>
        <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
        </wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches
        </wsa:Action>
    </s:Header>
    <s:Body>
        <d:ProbeMatches>
            <d:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:uuid:b0963146-a7ba-a965-b560-fdb9f9510753
                    </wsa:Address>
                </wsa:EndpointReference>
                <d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
                <d:Scopes>onvif://www.onvif.org/location/country/India
                    onvif://www.onvif.org/name/CP_Plus_Cloud_Camera
                    onvif://www.onvif.org/type/video_encoder
                    onvif://www.onvif.org/Profile/Streaming
                    onvif://www.onvif.org/Profile/T
                </d:Scopes>
                <d:XAddrs>http://192.168.0.113:8000/onvif/device_service</d:XAddrs>
                <d:MetadataVersion>1</d:MetadataVersion>
            </d:ProbeMatch>
        </d:ProbeMatches>
    </s:Body>
</s:Envelope>